DjimEbambe/IoTferme/edge-device-stack/esp32/gateway/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
